Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Anything that can be streamed to an `ostream` can be streamed to an assertion macro--in particular, C strings and `string` objects.
it_it: Tutto ciò che può essere inviato a un `ostream` e può essere inviato ad una macro di asserzione--in particolare, stringhe C e oggetti `string`.

source: Anything that can be streamed to an `ostream` can be streamed to an assertion macro—in particular, C strings and string objects.
it_it: Tutto ciò che può essere inviato in streaming a un `ostream` può essere inviato in streaming a una macro di asserzione, in particolare le stringhe C e gli oggetti stringa.

source: Appends an event listener to the end of the list.
it_it: Aggiunge un listener di eventi alla fine dell'elenco.

source: Are we using a single-template-parameter action where bool refers to the type of x, or a two-template-parameter action where the compiler is asked to infer the type of x?
it_it: Stiamo utilizzando un'azione con parametro tempale singolo in cui bool si riferisce al tipo di x, o un'azione con due parametri template in cui al compilatore viene chiesto di dedurre il tipo di x?

source: Are we using a single-template-parameter action where `bool` refers to the type of `x`, or a two-template-parameter action where the compiler is asked to infer the type of `x`?
it_it: Stiamo utilizzando un'azione con parametro tempale singolo in cui `bool` si riferisce al tipo di `x`, o un'azione con due parametri template in cui al compilatore viene chiesto di dedurre il tipo di `x`?

source: Arghh, you need to refer to a mock function argument but C++ has no lambda (yet), so you have to define your own action.
it_it: Arghh, si deve fare riferimento a un argomento di funzione mock ma il C++ non ha (ancora) le lambda, quindi si deve definire la propria azione.

source: Arguments are always evaluated exactly once.
it_it: Gli argomenti vengono sempre valutati esattamente una volta.

source: Arguments are always evaluated exactly once, so it's OK for the arguments to have side effects.
it_it: Gli argomenti vengono sempre valutati esattamente una volta, quindi va bene che abbiano effetti collaterali.

source: As a result, any in-memory side effects they incur are observable in their respective sub-processes, but not in the parent process.
it_it: Di conseguenza, eventuali effetti collaterali in memoria che avvengono sono osservabili nei rispettivi sottoprocessi, ma non nel processo principale.

source: As a result, if you mock many different types of methods, compiling your mock class can get really slow.
it_it: Di conseguenza, se ci sono molti tipi diversi di metodi mock, la compilazione della classe mock può diventare molto lenta.

source: As a convenience and example, gMock provides some matchers for 2-tuples, including the Lt() matcher above.
it_it: Per comodità ed esempio, gMock fornisce alcuni matcher per 2-tuple, incluso il matcher Lt() precedente.

source: As a convenience and example, gMock provides some matchers for 2-tuples, including the `Lt()` matcher above.
it_it: Per comodità ed esempio, gMock fornisce alcuni matcher per 2-tuple, incluso il matcher `Lt()` precedente.

source: As a reminder, GoogleTest will print a banner warning you if a test program contains any disabled tests.
it_it: Come promemoria, GoogleTest stamperà un banner che avvisa se un programma di test contiene test disabilitati.

source: As a result, changing the implementation without breaking the contract (e.g. refactoring and optimization), which should be perfectly fine to do, can break such tests.
it_it: Di conseguenza, modificare l'implementazione senza infrangere il contratto (ad esempio refactoring e ottimizzazione), cosa che dovrebbe essere perfettamente consentita, può "rompere" tali test.

source: As a result, mocking is a proven effective technique and widely adopted practice in those communities.
it_it: Di conseguenza, il mocking è una tecnica comprovata ed efficace e una pratica ampiamente adottata in quelle comunità.

source: As a workaround, some users choose to construct the failure message by themselves, streaming it into EXPECT_TRUE().
it_it: Come soluzione alternativa, alcuni utenti scelgono di costruirsi da soli il messaggio di errore, accodandolo a EXPECT_TRUE().

source: As a workaround, some users choose to construct the failure message by themselves, streaming it into `EXPECT_TRUE()`.
it_it: Come soluzione alternativa, alcuni utenti scelgono di costruirsi da soli il messaggio di errore, accodandolo a `EXPECT_TRUE()`.

source: As an alternative you can place the arguments in a C-style array and use ElementsAreArray() or UnorderedElementsAreArray() instead:
it_it: In alternativa si possono inserire gli argomenti in un array in stile C e utilizzare invece ElementsAreArray() o UnorderedElementsAreArray():

source: As an alternative you can place the arguments in a C-style array and use `ElementsAreArray()` or `UnorderedElementsAreArray()` instead:
it_it: In alternativa si possono inserire gli argomenti in un array in stile C e utilizzare invece `ElementsAreArray()` o `UnorderedElementsAreArray()`:

source: As an example of its application, when you are designing an interface you can write a standard suite of abstract tests (perhaps using a factory function as the test parameter) that all implementations of the interface are expected to pass.
it_it: Come esempio della sua applicazione, quando si progetta un'interfaccia è possibile scrivere una suite standard di test astratti (magari utilizzando una funzione factory come parametro di test) e ci si aspetta che tutte le implementazioni dell'interfaccia li superino.

source: As an example, create a file named hello_test.cc in your my_project directory with the following contents:
it_it: Per esempio, creare un file chiamato hello_test.cc nella directory my_project col seguente contenuto:

source: As an example, create a file named hello_test.cc in your my_workspace directory with the following contents:
it_it: Come esempio, si crea un file denominato hello_test.cc nella directory my_workspace col seguente contenuto:

source: As an example, create a file named `hello_test.cc` in your `my_project` directory with the following contents:
it_it: Per esempio, creare un file chiamato `hello_test.cc` nella directory `my_project` col seguente contenuto:

source: As an example, create a file named `hello_test.cc` in your `my_workspace` directory with the following contents:
it_it: Come esempio, si crea un file denominato `hello_test.cc` nella directory `my_workspace` col seguente contenuto:

source: As an example, let's define an action that returns the second argument in the mock function's argument list.
it_it: Come esempio, definiamo un'azione che restituisce il secondo argomento nell'elenco degli argomenti della funzione mock.

source: As an example, let's write tests for a FIFO queue class named Queue, which has the following interface:
it_it: Ad esempio, scriviamo i test per una classe di una coda FIFO chiamata Queue, che ha la seguente interfaccia:

source: As an example, let's write tests for a FIFO queue class named `Queue`, which has the following interface:
it_it: Ad esempio, scriviamo i test per una classe di una coda FIFO chiamata `Queue`, che ha la seguente interfaccia:

source: As an example, see the following code:
it_it: Ad esempio, vedere il seguente codice:

source: As mentioned earlier, the printer is *extensible*.
it_it: Come accennato in precedenza, la stampante è *extensible*.

source: As mentioned earlier, the printer is extensible.
it_it: Come accennato in precedenza, la stampante è estensibile.

source: As said earlier, you don't get to (or need to) specify arg_type as that's determined by the context in which the matcher is used.
it_it: Come detto in precedenza, non si può (né si deve) specificare arg_type poiché viene determinato dal contesto in cui viene utilizzato il matcher.

source: As said earlier, you don't get to (or need to) specify `arg_type` as that's determined by the context in which the matcher is used.
it_it: Come detto in precedenza, non si può (né si deve) specificare `arg_type` poiché viene determinato dal contesto in cui viene utilizzato il matcher.

source: As shown above, if your test calls a subroutine that has an ASSERT_* failure in it, the test will continue after the subroutine returns.
it_it: Come mostrato sopra, se il test chiama una subroutine che presenta un errore ASSERT_*, il test continuerà dopo il ritorno della subroutine.

source: As shown above, if your test calls a subroutine that has an `ASSERT_*` failure in it, the test will continue after the subroutine returns.
it_it: Come mostrato sopra, se il test chiama una subroutine che presenta un errore `ASSERT_*`, il test continuerà dopo il ritorno della subroutine.

source: As the function now returns void, you can use any assertion inside of it.
it_it: Dato che la funzione ora restituisce void, si può utilizzare qualsiasi asserzione al suo interno.

source: As the function now returns `void`, you can use any assertion inside of it.
it_it: Dato che la funzione ora restituisce `void`, si può utilizzare qualsiasi asserzione al suo interno.

source: As usual, if you set an expectation without an action (i.e. the .WillOnce() or .WillRepeatedly() clause), when that expectation fires, the default action for that method will be taken.
it_it: Come al solito, se si imposta una expectation senza un'azione (ad esempio la clausola .WillOnce() o la .WillRepeatedly()), quando si attiva la expectation, l'azione di default per quel metodo verrà intrapresa.

source: As usual, if you set an expectation without an action (i.e. the `.WillOnce()` or `.WillRepeatedly()` clause), when that expectation fires, the default action for that method will be taken.
it_it: Come al solito, se si imposta una expectation senza un'azione (ad esempio la clausola `.WillOnce()` o la `.WillRepeatedly()`), quando si attiva la expectation, l'azione di default per quel metodo verrà intrapresa.

source: As with assertion macros, you can stream a custom message into GTEST_SKIP().
it_it: Come con le macro delle asserzioni, si può accodare un messaggio personalizzato in GTEST_SKIP().

source: As with assertion macros, you can stream a custom message into `GTEST_SKIP()`.
it_it: Come con le macro delle asserzioni, si può accodare un messaggio personalizzato in `GTEST_SKIP()`.

source: As you may have guessed, when there are more than one ON_CALL() statements, the newer ones in the order take precedence over the older ones.
it_it: Come intuito, quando ci sono più istruzioni ON_CALL(), quelle più recenti nell'ordine hanno la precedenza su quelle più vecchie.

source: As you may have guessed, when there are more than one `ON_CALL()` statements, the newer ones in the order take precedence over the older ones.
it_it: Come intuito, quando ci sono più istruzioni `ON_CALL()`, quelle più recenti nell'ordine hanno la precedenza su quelle più vecchie.

source: As you may have noticed, the auto-generated descriptions (especially those for the negation) may not be so great.
it_it: Come notato, le descrizioni generate automaticamente (specialmente quelle per la negazione) potrebbero non essere così eccezionali.

source: As you may have realized, InvokeWithoutArgs(...) is just syntactic sugar for WithoutArgs(Invoke(...)).
it_it: Si comprenderà che InvokeWithoutArgs(...) è solo zucchero sintattico per WithoutArgs(Invoke(...)).

source: As you may have realized, `InvokeWithoutArgs(...)` is just syntactic sugar for `WithoutArgs(Invoke(...))`.
it_it: Si comprenderà che `InvokeWithoutArgs(...)` è solo "zucchero sintattico" per `WithoutArgs(Invoke(...))`.

source: As you might have guessed, this test checks that PenDown() is called at least once.
it_it: Come intuito, questo test verifica che PenDown() venga chiamato almeno una volta.

source: As you might have guessed, this test checks that `PenDown()` is called at least once.
it_it: Come intuito, questo test verifica che `PenDown()` venga chiamato almeno una volta.

source: Asserting Using gMock Matchers
it_it: Asserzioni con l'uso dei Matcher di gMock

source: Asserting on Subroutines
it_it: Asserzione sulle Subroutine

source: Asserting on Subroutines with an exception
it_it: Asserzione sulle Subroutine con un'eccezione

source: Assertion Placement
it_it: Posizionamento delle Asserzioni

source: Assertion macros like EXPECT_THAT and EXPECT_EQ also print the values in question when the assertion fails.
it_it: Anche le macro di asserzione come EXPECT_THAT e EXPECT_EQ stampano i valori in questione quando l'asserzione fallisce.

source: Assertion macros like `EXPECT_THAT` and `EXPECT_EQ` also print the values in question when the assertion fails.
it_it: Anche le macro di asserzione come `EXPECT_THAT` e `EXPECT_EQ` stampano i valori in questione quando l'asserzione fallisce.

source: AssertionResult AssertionSuccess(); // Returns an AssertionResult object to indicate that an assertion has // failed.
it_it: AssertionResult AssertionSuccess(); // Restituisce un oggetto AssertionResult per indicare che un'asserzione // è fallita.

source: Assertions
it_it: Le Asserzioni

source: Assertions Reference
it_it: Riferimenti sulle Asserzioni

source: Assertions from multiple threads are currently not supported on Windows.
it_it: Le asserzioni provenienti da più thread non sono attualmente supportate in Windows.

source: Asserts that actual_value matches matcher.
it_it: Afferma che actual_value corrisponde al matcher.

source: Asserts that `actual_value` matches `matcher`.
it_it: Afferma che `actual_value` corrisponde al `matcher`.

source: Assign value to the variable pointed by the N-th (0-based) argument.
it_it: Assegna value alla variabile puntata dall'argomento N-esimo (in base 0).

source: Assign value to the variable referenced by the N-th (0-based) argument.
it_it: Assegna value alla variabile a cui fa riferimento l'argomento N-esimo (in base 0).

source: Assign value to variable.
it_it: Assegna value a variable.

source: Assign `value` to the variable pointed by the `N`-th (0-based) argument.
it_it: Assegna `value` alla variabile puntata dall'argomento `N`-esimo (in base 0).

source: Assign `value` to the variable referenced by the `N`-th (0-based) argument.
it_it: Assegna `value` alla variabile a cui fa riferimento l'argomento `N`-esimo (in base 0).

source: Assign `value` to variable.
it_it: Assegna `value` a variable.

source: At the first sign of a failure, the debugger is automatically invoked.
it_it: Al primo segnale di errore, il debugger viene richiamato automaticamente.

source: At this setting, gMock will also log any calls to the ON_CALL/EXPECT_CALL macros.
it_it: Con questa impostazione, gMock loggerà anche tutte le chiamate alle macro ON_CALL/EXPECT_CALL.

source: At this setting, gMock will also log any calls to the `ON_CALL/EXPECT_CALL` macros.
it_it: Con questa impostazione, gMock loggerà anche tutte le chiamate alle macro `ON_CALL/EXPECT_CALL`.

source: Available since v1.1.0.
it_it: Disponibile dalla v1.1.0.

source: Back to the original questions: why does gMock search the expectations (and ON_CALLs) from back to front?
it_it: Torniamo alle domande originali: perché gMock cerca le expectation (e le ON_CALL) da dietro in avanti?

source: Back to the original questions: why does gMock search the expectations (and `ON_CALL`s) from back to front?
it_it: Torniamo alle domande originali: perché gMock cerca le expectation (e le `ON_CALL`) da dietro in avanti?

source: BaseTest::SetUp(); // Sets up the base fixture first.
it_it: BaseTest::SetUp(); // Configura prima la fixture base.

source: BaseTest::TearDown(); // Remember to tear down the base fixture
it_it: BaseTest::TearDown(); // Ricordarsi di dismettere la fixture base

source: Basic Concepts
it_it: Concetti Base

source: Because this allows a user to set up a mock's behavior for the common case early (e.g. in the mock's constructor or the test fixture's set-up phase) and customize it with more specific rules later.
it_it: Perché ciò consente all'utente di impostare in anticipo il comportamento di un mock per il caso comune (ad esempio nel costruttore del mock o nella fase di impostazione della fixture) e di personalizzarlo con regole più specifiche in seguito.

source: Because we think our rule makes the common cases easier to express and understand.).
it_it: Perché pensiamo che la nostra regola renda i casi comuni più facili da esprimere e comprendere).

source: Before C++11, the functor-based actions were not supported; the old way of writing actions was through a set of ACTION* macros.
it_it: Prima di C++11 le azioni basate su funtori non erano supportate; il vecchio modo di scriverle era attraverso una serie di macro ACTION*.

source: Before C++11, the functor-based actions were not supported; the old way of writing actions was through a set of `ACTION*` macros.
it_it: Prima di C++11 le azioni basate su funtori non erano supportate; il vecchio modo di scriverle era attraverso una serie di macro `ACTION*`.

source: Before the generic MOCK_METHOD macro was introduced in 2018, mocks where created using a family of macros collectively called MOCK_METHODn.
it_it: Prima che la macro generica MOCK_METHOD venisse introdotta nel 2018, i mock venivano creati utilizzando una famiglia di macro chiamate MOCK_METHODn.

source: Before the generic `MOCK_METHOD` macro [was introduced in 2018](https://github.com/google/googletest/commit/c5f08bf91944ce1b19bcf414fa1760e69d20afc2), mocks where created using a family of macros collectively called `MOCK_METHODn`.
it_it: Prima che la macro generica `MOCK_METHOD` [venisse introdotta nel 2018](https://github.com/google/googletest/commit/c5f08bf91944ce1b19bcf414fa1760e69d20afc2), i mock venivano creati utilizzando una famiglia di macro chiamate `MOCK_METHODn`.

source: Before we continue, it is recommended to **always** define the following two variables for pkg-config in a cross-compilation setting:
it_it: Prima di continuare, si consiglia di definire **sempre** le seguenti due variabili per pkg-config in un'impostazione di cross-compilazione:

source: Before we continue, it is recommended to always define the following two variables for pkg-config in a cross-compilation setting:
it_it: Prima di continuare, si consiglia di definire sempre le seguenti due variabili per pkg-config in un'impostazione di cross-compilazione:

source: Behavior
it_it: Comportamento

source: Believe it or not, the *vast majority* of the time spent on compiling a mock class is in generating its constructor and destructor, as they perform non-trivial tasks (e.g. verification of the expectations).
it_it: Che ci si creda o meno, la *stragrande maggioranza* del tempo impiegato nella compilazione di una classe mock è nella generazione del suo costruttore e del distruttore, poiché eseguono compiti non banali (ad esempio la verifica delle expectation).

source: Believe it or not, the vast majority of the time spent on compiling a mock class is in generating its constructor and destructor, as they perform non-trivial tasks (e.g. verification of the expectations).
it_it: Che ci si creda o meno, la stragrande maggioranza del tempo impiegato nella compilazione di una classe mock è nella generazione del suo costruttore e del distruttore, poiché eseguono compiti non banali (ad esempio la verifica delle expectation).

source: Below is what we do support (A denotes a literal character, period (.), or a single \\ escape sequence; x and y denote regular expressions.):
it_it: Di seguito è riportato ciò che supportiamo (A indica un carattere letterale, un punto (.), o una singola sequenza di escape \\ ; x e y denotano espressioni regolari):

source: Below is what we do support (`A` denotes a literal character, period (`.`), or a single `\\ ` escape sequence; `x` and `y` denote regular expressions.):
it_it: Di seguito è riportato ciò che supportiamo (`A` indica un carattere letterale, un punto (`.`), o una singola sequenza di escape `\\ `; `x` e `y` denotano espressioni regolari):

source: Beware of the Nomenclature
it_it: Attenzione alla Nomenclatura

source: Binary Comparison {#binary-comparison}
it_it: Confronti Binari {#binary-comparison}

source: Boolean Conditions {#boolean}
it_it: Condizioni Booleane {#boolean}

source: Both arguments *`TestFixtureName`* and *`TestName`* must be valid C++ identifiers and must not contain underscores (`_`).
it_it: Entrambi gli argomenti *`TestFixtureName`* e *`TestName`* devono essere identificatori C++ validi e non devono contenere underscore (`_`).

source: Both arguments *`TestSuiteName`* and *`TestName`* must be valid C++ identifiers and must not contain underscores (`_`).
it_it: Entrambi gli argomenti *`TestSuiteName`* e *`TestName`* devono essere identificatori C++ validi e non devono contenere underscore (`_`).

source: Both arguments TestFixtureName and TestName must be valid C++ identifiers and must not contain underscores (_).
it_it: Entrambi gli argomenti TestFixtureName e TestName devono essere identificatori C++ validi e non devono contenere underscore (_).

source: Both arguments TestSuiteName and TestName must be valid C++ identifiers and must not contain underscores (_).
it_it: Entrambi gli argomenti TestSuiteName e TestName devono essere identificatori C++ validi e non devono contenere underscore (_).

source: Both names must be valid C++ identifiers, and they should not contain any underscores (_).
it_it: Entrambi i nomi devono essere identificatori C++ validi e non devono contenere underscore (_).

source: Both names must be valid C++ identifiers, and they should not contain any underscores (`_`).
it_it: Entrambi i nomi devono essere identificatori C++ validi e non devono contenere underscore (`_`).

source: Both static functions and definitions/declarations in an unnamed namespace are only visible within the same translation unit.
it_it: Sia le funzioni statiche che le definizioni/dichiarazioni in un namespace anonimo sono visibili solo all'interno della stessa unità di traduzione.

source: Built-in matchers (where argument is the function argument, e.g. actual_value in the example above, or when used in the context of EXPECT_CALL(mock_object, method(matchers)), the arguments of method) are divided into several categories.
it_it: I matcher nativi (dove argument è l'argomento della funzione, ad esempio actual_value nell'esempio sopra, o quando utilizzato nel contesto di EXPECT_CALL(mock_object, method(matchers)), gli argomenti di method) sono divisi in diverse categorie.

source: Built-in matchers (where `argument` is the function argument, e.g. `actual_value` in the example above, or when used in the context of `EXPECT_CALL(mock_object, method(matchers))`, the arguments of `method`) are divided into several categories.
it_it: I matcher nativi (dove `argument` è l'argomento della funzione, ad esempio `actual_value` nell'esempio sopra, o quando utilizzato nel contesto di `EXPECT_CALL(mock_object, method(matchers))`, gli argomenti di `method`) sono divisi in diverse categorie.

source: But GoogleTest doesn't use exceptions, so how do we test that a piece of code generates an expected failure?
it_it: Ma GoogleTest non utilizza eccezioni, quindi come possiamo verificare che una parte di codice generi un errore previsto?

source: But I don't like calling my entire test suite *DeathTest when it contains both death tests and non-death tests.
it_it: Ma non mi piace chiamare tutta la mia test suite *DeathTest quando contiene sia death test che non.

source: But I don't like calling my entire test suite `*DeathTest` when it contains both death tests and non-death tests.
it_it: Ma non mi piace chiamare tutta la mia test suite `*DeathTest` quando contiene sia death test che non.
